let a = `
施** 7 10
施** 8 50
施** 9 50
朱** 5 5
朱** 6 5
朱** 7 5
朱** 8 20
朱** 9 65
金** 7 10
金** 8 80
金** 9 10
黄** 5 2
黄** 6 8
黄** 7 10
黄** 8 20
黄** 9 60
贵** 6 8
贵** 7 22
贵** 8 30
贵** 9 40
梁** 5 10
梁** 6 8
梁** 7 22
梁** 8 40
梁** 9 20
陈** 5 2
陈** 7 10
陈** 8 40
陈** 9 48
泮** 5 2
泮** 6 8
泮** 7 35
泮** 8 35
泮** 9 20
罗** 5 2
罗** 6 8
罗** 7 30
罗** 8 40
罗** 9 20
谢** 5 2
谢** 6 6
谢** 7 30
谢** 8 60
褚** 0 10
褚** 5 5
褚** 6 10
褚** 7 10
褚** 8 25
褚** 9 40
杜** 5 2
杜** 7 10
杜** 8 50
杜** 9 38
李** 5 2
李** 6 20
李** 7 18
李** 8 30
李** 9 20
`
function f(a){
    var b = a.split('\n');
    var c=b.map(b=>b.split(' '))
    let types = [];
    types[5] ="50%-60%";
    types[6] ="60%-70%";
    types[7] ="70%-80%";
    types[8] ="80%-90%";
    types[9] ="90%-100%";
    var d=c.map(c=>({name:c[0],type:types[parseInt(c[1])],percent:parseInt(c[2])}))
    var e = JSON.stringify(d,null,2);
    console.log(e);
}
    
f(a);
